{"_id":"1","Title":"Knocked Up","Description":"Knocked Up is a 2007 American romantic comedy film written, co-produced and directed by Judd Apatow, and starring Seth Rogen, Katherine Heigl, Paul Rudd, and Leslie Mann. It follows the repercussions of a drunken one-night stand between a slacker and a recently promoted media personality that results in an unintended pregnancy.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Bio":"Judd Apatow is an American producer, writer, director, actor and stand-up comedian.","Birth":"1967"},"ImagePath":"https://www.themoviedb.org/t/p/original/caCpMc3NOvyPpNY2PFHFgqsQC63.jpg","Featured":false}
{"_id":"2","Title":"Amelie","Description":"Amélie, also known as The Fabulous Destiny of Amélie Poulain, is a 2001 French-language romantic comedy film directed by Jean-Pierre Jeunet. The film is a whimsical depiction of contemporary Parisian life, set in Montmartre. It tells the story of a shy waitress, played by Audrey Tautou, who decides to change the lives of those around her for the better while dealing with her own isolation.","Genre":{"Name":"Romantic Comedy","Description":"Romantic comedy (also known as romcom or rom-com) is a subgenre of comedy and slice of life fiction, focusing on lighthearted, humorous plot lines centered on romantic ideas, such as how true love is able to surmount most obstacles."},"Director":{"Name":"Jean-Pierre Jeunet","Bio":"Jeunet is a French film director, producer and screenwriter. His films combine fantasy, realism and science fiction to create idealized realities or to give relevance to mundane situations.","Birth":"1953"},"ImagePath":"https://www.themoviedb.org/t/p/original/xU7E72Bq8drUKtcW3xCwaC5EeBV.jpg","Featured":true}
{"_id":"3","Title":"Eternal Sunshine of the Spotless Mind","Description":"Eternal Sunshine of the Spotless Mind is a 2004 American romantic science fiction drama film written by Charlie Kaufman, directed by Michel Gondry, and starring Jim Carrey and Kate Winslet. Pierre Bismuth created the story with Kaufman and Gondry. The film features an ensemble supporting cast that includes Kirsten Dunst, Mark Ruffalo, Elijah Wood, and Tom Wilkinson. The title of the film is a quotation from the 1717 poem Eloisa to Abelard by Alexander Pope. The picture uses elements of psychological drama, science fiction and a nonlinear narrative to explore the nature of memory and romantic love.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Michael Gondry","Bio":"Michael Gondry is a French filmmaker noted for his inventive visual style and distinctive manipulation of mise en scène.[1] Along with Charlie Kaufman, he won an Academy Award for Best Original Screenplay as one of the writers of the 2004 film Eternal Sunshine of the Spotless Mind, a film he also directed.","Birth":"1963"},"ImagePath":"https://www.themoviedb.org/t/p/original/5MwkWH9tYHv3mV9OdYTMR5qreIz.jpg","Featured":false}
{"_id":"4","Title":"Memento","Description":"Memento is a 2000 American neo-noir mystery thriller film written and directed by Christopher Nolan, and produced by Suzanne and Jennifer Todd. The film's script was based on a pitch by Nolan's brother Jonathan Nolan, who wrote the 2001 story ‘Memento Mori’ from the concept. Guy Pearce stars as Leonard Shelby, a man who suffers from anterograde amnesia, resulting in short-term memory loss and the inability to form new memories. He is searching for the people who attacked him and killed his wife, using an intricate system of Polaroid photographs and tattoos to track information he cannot remember.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. His films have grossed more than US$5 billion worldwide and have garnered 11 Academy Awards from 36 nominations. Nolan's films are typically rooted in epistemological and metaphysical themes, exploring human morality, the construction of time, and the malleable nature of memory and personal identity. His work is permeated by mathematically inspired images and concepts, unconventional narrative structures, practical special effects, experimental soundscapes, large-format film photography, and materialistic perspectives.","Birth":"1970"},"ImagePath":"https://www.themoviedb.org/t/p/original/3jFQqn81xdYqNquQZtsu8PJBPiB.jpg","Featured":false}
{"_id":"5","Title":"Lost In Translation","Description":"Lost in Translation is a 2003 romantic comedy-drama film written and directed by Sofia Coppola. Bill Murray stars as Bob Harris, a fading American movie star who is having a midlife crisis when he travels to Tokyo to promote Suntory whisky. There, he befriends another estranged American named Charlotte, a young woman and recent college graduate played by Scarlett Johansson. Giovanni Ribisi and Anna Faris also feature. The film explores themes of alienation and disconnection against a backdrop of cultural displacement in Japan.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Sofia Coppola","Bio":"Sofia Carmina Coppola is an American filmmaker and former actress. The youngest child and only daughter of filmmakers Eleanor and Francis Ford Coppola, she made her film debut as an infant in her father's acclaimed crime drama film The Godfather (1972). Coppola later appeared in several music videos, as well as a supporting role in Peggy Sue Got Married (1986). Coppola then portrayed Mary Corleone, the daughter of Michael Corleone, in The Godfather Part III (1990). She then turned her attention to filmmaking.","Birth":"1971"},"ImagePath":"https://www.themoviedb.org/t/p/original/1WTyI50aYiM3cCVsNeo1hepYiFt.jpg","Featured":false}
{"_id":"6","Title":"500 Days of Summer","Description":"500 Days of Summer is a 2009 American romantic comedy-drama film directed by Marc Webb from a screenplay written by Scott Neustadter and Michael H. Weber. The film stars Joseph Gordon-Levitt and Zooey Deschanel, and employs a nonlinear narrative structure, with the story based upon its male protagonist and his memories of a failed relationship.","Genre":{"Name":"Romantic Comedy","Description":"Romantic comedy (also known as romcom or rom-com) is a subgenre of comedy and slice of life fiction, focusing on lighthearted, humorous plot lines centered on romantic ideas, such as how true love is able to surmount most obstacles."},"Director":{"Name":"Marc Webb","Bio":"Marc Preston Webb is an American music video director and filmmaker. Webb made his feature film directorial debut in 2009 with the romantic comedy 500 Days of Summer, and went on to direct The Amazing Spider-Man in 2012 and its sequel The Amazing Spider-Man 2 in 2014, for which he was dubbed the Webb-Verse by Marvel Studios in 2021. He also directed the drama films Gifted and The Only Living Boy in New York.","Birth":"1974"},"ImagePath":"https://www.themoviedb.org/t/p/original/28USFBOnuqqtRkL8ovly99L4ROD.jpg","Featured":false}
{"_id":"7","Title":"Catch Me If You Can","Description":"Catch Me If You Can is a 2002 American biographical crime comedy-drama film directed and produced by Steven Spielberg and starring Leonardo DiCaprio and Tom Hanks with Christopher Walken, Martin Sheen and Nathalie Baye in supporting roles. The screenplay by Jeff Nathanson is based on the autobiography of Frank Abagnale, who claims that before his 19th birthday, he successfully performed cons worth millions of dollars by posing as a Pan American World Airways pilot, a Georgia doctor, and a Louisiana parish prosecutor. The truth of his story is questionable.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg is an American film director, producer, and screenwriter. A figure of the New Hollywood era, he is the most commercially successful director of all time. Spielberg is the recipient of various accolades, including three Academy Awards (including two Best Director wins), a Kennedy Center honor, a Cecil B. DeMille Award, and an AFI Life Achievement Award. In 2013, Time magazine listed him as one of the 100 most influential people.","Birth":"1946"},"ImagePath":"https://www.themoviedb.org/t/p/original/sdYgEkKCDPWNU6KnoL4qd8xZ4w7.jpg","Featured":false}
{"_id":"8","Title":"Batman Begins","Description":"Batman Begins is a 2005 superhero film directed by Christopher Nolan and written by Nolan and David S. Goyer. The film is based on the DC Comics character Batman, it stars Christian Bale as Bruce Wayne / Batman, with Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, and Morgan Freeman in supporting roles. The film reboots the Batman film series, telling the origin story of Bruce Wayne from the death of his parents to his journey to become Batman and his fight to stop Ras al Ghul and the Scarecrow from plunging Gotham City into chaos.","Genre":{"Name":"Superhero","Description":"A superhero film (or superhero movie) is a film that focuses on the actions of superheroes. Superheroes are individuals who possess extraordinary (superhuman) abilities and are dedicated to protecting the public. These films typically feature action, adventure, fantasy, and/or science fiction elements. The first film of a particular character often focuses on the hero's origin story-- the story of how they got their special powers. The first film frequently introduces the hero's nemesis."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. His films have grossed more than US$5 billion worldwide and have garnered 11 Academy Awards from 36 nominations. Nolan's films are typically rooted in epistemological and metaphysical themes, exploring human morality, the construction of time, and the malleable nature of memory and personal identity. His work is permeated by mathematically inspired images and concepts, unconventional narrative structures, practical special effects, experimental soundscapes, large-format film photography, and materialistic perspectives.","Birth":"1970"},"ImagePath":"https://www.themoviedb.org/t/p/original/bY1SD4t8to0OJh3NBTan4kpMM7M.jpg","Featured":false}
{"_id":"9","Title":"The Lord of the Rings: The Fellowship of the Ring","Description":"The Lord of the Rings: The Fellowship of the Ring is a 2001 epic fantasy adventure film directed by Peter Jackson. Set in Middle-earth, the story tells of the Dark Lord Sauron, who seeks the One Ring, which contains part of his soul, in order to return to power. The Ring has found its way to the young hobbit Frodo Baggins. The fate of Middle-earth hangs in the balance as Frodo and eight companions (who form the Fellowship of the Ring) begin their journey to Mount Doom in the land of Mordor, the only place where the Ring can be destroyed.","Genre":{"Name":"Epic","Description":"Epic films are a style of filmmaking with large-scale, sweeping scope, and spectacle. The usage of the term has shifted over time, sometimes designating a film genre and at other times simply synonymous with big-budget filmmaking. Like epics in the classical literary sense it is often focused on a heroic character. An epic's ambitious nature helps to set it apart from other types of film such as the period piece or adventure film."},"Director":{"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy (2001–2003) and the Hobbit trilogy (2012–2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien. Other notable films include the critically lauded drama Heavenly Creatures (1994), the horror comedy The Frighteners (1996), the epic monster remake film King Kong (2005), the World War I documentary film They Shall Not Grow Old (2018) and the documentary The Beatles: Get Back (2021). He is the third-highest-grossing film director of all-time, his films having made over $6.5 billion worldwide.","Birth":"1961"},"ImagePath":"https://www.themoviedb.org/t/p/original/yXFyL3Oi9l1Ufm98lQliOSoU4me.jpg","Featured":false}
{"_id":"10","Title":"WALL-E","Description":"WALL-E is a 2008 American computer-animated science fiction film produced by Pixar Animation Studios and released by Walt Disney Pictures. WALL-E follows a solitary robot on a future, uninhabitable, deserted Earth in 2805, left to clean up garbage. However, he is visited by a probe sent by the starship Axiom, a robot called EVE, with whom he falls in love and pursues across the galaxy.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Andrew Stanton","Bio":"Andrew Ayers Stanton is an American filmmaker and voice actor based at Pixar, which he joined in 1990. His film work includes co-writing and co-directing Pixar's A Bug's Life (1998), directing Finding Nemo (2003)[3] and the sequel Finding Dory (2016), WALL-E (2008), and the live-action film, Disney's John Carter (2012), and co-writing all four Toy Story films (1995–2019) and Monsters, Inc. (2001).","Birth":"1965"},"ImagePath":"https://www.themoviedb.org/t/p/original/1QK5TPUKuOehnOZVE874G51g4d3.jpg","Featured":false}
